Repository: bindevz/TILSOFTAIv2
Catalog: src/TILSOFTAI.Domain/Properties/Resources.*.resx
Languages: vi_vn

# Val_ToolNameRequired
source: Tool name is required.
vi_vn: Tên công cụ là bắt buộc.

# Val_HandlerTypeMustImplementIToolHandler
source: Handler type must implement IToolHandler.
vi_vn: Kiểu xử lý phải triển khai IToolHandler.

# Val_ToolDefinitionNameRequired
source: ToolDefinition.Name is required.
vi_vn: ToolDefinition.Name là bắt buộc.

# Val_ToolDefinitionInstructionRequired
source: ToolDefinition.Instruction is required.
vi_vn: ToolDefinition.Instruction là bắt buộc.

# Val_ToolDefinitionJsonSchemaRequired
source: ToolDefinition.JsonSchema is required.
vi_vn: ToolDefinition.JsonSchema là bắt buộc.

# Val_ToolDefinitionSpNameMustStartWithAi
source: ToolDefinition.SpName must start with 'ai_'.
vi_vn: ToolDefinition.SpName phải bắt đầu bằng 'ai_'.

# Val_ArgumentsJsonRequired
source: Arguments JSON is required.
vi_vn: Arguments JSON là bắt buộc.

# Val_MissingRequiredProperty
source: Missing required property '{0}'.
vi_vn: Thiếu thuộc tính bắt buộc '{0}'.

# Val_PropertyMustBeIntegerGreaterThanOne
source: Property '{0}' must be an integer >= 1.
vi_vn: Thuộc tính '{0}' phải là số nguyên >= 1.

# Val_PropertyMustBeArray
source: Property '{0}' must be an array.
vi_vn: Thuộc tính '{0}' phải là một mảng.

# Val_PropertyMustContainIntegersGreaterThanOne
source: Property '{0}' must contain integers >= 1.
vi_vn: Thuộc tính '{0}' phải chứa các số nguyên >= 1.

# Val_PropertyMustContainMinimumItems
source: Property '{0}' must contain at least {1} items.
vi_vn: Thuộc tính '{0}' phải chứa ít nhất {1} mục.

# Val_StoredProcedureRequired
source: Stored procedure name is required.
vi_vn: Tên thủ tục lưu trữ là bắt buộc.

# Val_ProposedSpNameRequired
source: Proposed SP name is required.
vi_vn: Tên SP đề xuất là bắt buộc.

# Val_SchemaValidationFailed
source: Schema validation failed: {0}
vi_vn: Xác thực lược đồ thất bại: {0}

# Val_ArgumentsMustBeValidJson
source: Arguments must be valid JSON: {0}
vi_vn: Đối số phải là JSON hợp lệ: {0}

# Val_SchemaValidationFailedAtExecutionTime
source: Schema validation failed at execution time: {0}
vi_vn: Xác thực lược đồ thất bại tại thời điểm thực thi: {0}

# Val_QueryRequiredForCatalogSearch
source: Query is required for catalog_search
vi_vn: Truy vấn là bắt buộc cho catalog_search

# Val_DatasetKeyRequiredForCatalogGetDataset
source: DatasetKey is required for catalog_get_dataset
vi_vn: DatasetKey là bắt buộc cho catalog_get_dataset

# Val_PlanJsonRequiredForAnalyticsValidatePlan
source: PlanJson is required for analytics_validate_plan
vi_vn: PlanJson là bắt buộc cho analytics_validate_plan

# Val_IdRequired
source: id is required.
vi_vn: id là bắt buộc.

# Val_EventNameRequired
source: Event name is required.
vi_vn: Tên sự kiện là bắt buộc.

# Val_JwksAddressRequired
source: JWKS address must be provided.
vi_vn: Địa chỉ JWKS phải được cung cấp.

# Val_RequestBodyRequired
source: Request body is required.
vi_vn: Nội dung yêu cầu là bắt buộc.

# Val_MessagesRequired
source: messages is required.
vi_vn: messages là bắt buộc.

# Val_LastMessageMustBeUserMessage
source: The last message must be a user message.
vi_vn: Tin nhắn cuối cùng phải là tin nhắn của người dùng.

# Val_AtLeastOneUserMessageRequired
source: At least one user message is required.
vi_vn: Ít nhất một tin nhắn của người dùng là bắt buộc.

# Val_ModuleArgumentRequired
source: Missing required 'module' argument.
vi_vn: Thiếu đối số 'module' bắt buộc.

# Val_RuleKeyArgumentRequired
source: Missing required 'ruleKey' argument.
vi_vn: Thiếu đối số 'ruleKey' bắt buộc.

# Val_ProposedToolNameArgumentRequired
source: Missing required 'proposedToolName' argument.
vi_vn: Thiếu đối số 'proposedToolName' bắt buộc.

# Val_ProposedSpNameArgumentRequired
source: Missing required 'proposedSpName' argument.
vi_vn: Thiếu đối số 'proposedSpName' bắt buộc.

# Val_ArgsJsonArgumentRequired
source: Missing required 'argsJson' argument.
vi_vn: Thiếu đối số 'argsJson' bắt buộc.

# Val_PlanJsonRequired
source: atomic_execute_plan requires planJson.
vi_vn: atomic_execute_plan yêu cầu planJson.

# Ex_ToolAlreadyRegistered
source: Tool '{0}' is already registered.
vi_vn: Công cụ '{0}' đã được đăng ký.

# Ex_ToolAlreadyRegisteredWithDifferentHandler
source: Tool '{0}' is already registered with a different handler type: {1}.
vi_vn: Công cụ '{0}' đã được đăng ký với kiểu xử lý khác: {1}.

# Ex_PlanValidationFailed
source: Plan validation failed.
vi_vn: Xác thực kế hoạch thất bại.

# Ex_WriteActionsMustNotExecuteAiStoredProcedures
source: Write actions must not execute ai_ stored procedures directly.
vi_vn: Hành động ghi không được thực thi thủ tục lưu trữ ai_ trực tiếp.

# Ex_WriteActionNotAllowedOrNotFound
source: Write action '{0}' is not allowed or not found in the WriteActionCatalog.
vi_vn: Hành động ghi '{0}' không được phép hoặc không tìm thấy trong WriteActionCatalog.

# Ex_WriteActionCurrentlyDisabled
source: Write action '{0}' is currently disabled.
vi_vn: Hành động ghi '{0}' hiện đang bị vô hiệu hóa.

# Ex_ActionRequestNotFound
source: Action request not found.
vi_vn: Không tìm thấy yêu cầu hành động.

# Ex_ActionRequestMustBeApproved
source: Action request must be approved before execution.
vi_vn: Yêu cầu hành động phải được phê duyệt trước khi thực thi.

# Ex_WriteActionNoLongerAllowed
source: Write action '{0}' is no longer allowed.
vi_vn: Hành động ghi '{0}' không còn được phép.

# Ex_WriteActionHasBeenDisabled
source: Write action '{0}' has been disabled.
vi_vn: Hành động ghi '{0}' đã bị vô hiệu hóa.

# Ex_ToolSpNameRequired
source: Tool SP name is required.
vi_vn: Tên SP của công cụ là bắt buộc.

# Ex_DiagnosticsToolHandlerCanOnlyExecuteAiDiagnosticsRun
source: Diagnostics tool handler can only execute ai_diagnostics_run.
vi_vn: Trình xử lý công cụ chẩn đoán chỉ có thể thực thi ai_diagnostics_run.

# Ex_DiagnosticsArgumentsFailedSchemaValidation
source: Diagnostics arguments failed schema validation.
vi_vn: Đối số chẩn đoán không xác thực lược đồ.

# Ex_DiagnosticsRequiresModuleAndRuleKey
source: Diagnostics requires module and ruleKey.
vi_vn: Chẩn đoán yêu cầu module và ruleKey.

# Ex_ExecutionContextTenantIdRequired
source: Execution context TenantId is required.
vi_vn: Ngữ cảnh thực thi TenantId là bắt buộc.

# Ex_AtomicExecutePlanToolHandlerCanOnlyExecuteAiAtomicExecutePlan
source: Atomic execute plan tool handler can only execute ai_atomic_execute_plan.
vi_vn: Trình xử lý công cụ thực thi kế hoạch nguyên tử chỉ có thể thực thi ai_atomic_execute_plan.

# Ex_AtomicExecutePlanArgumentsFailedSchemaValidation
source: Atomic execute plan arguments failed schema validation.
vi_vn: Đối số thực thi kế hoạch nguyên tử không xác thực lược đồ.

# Ex_ExecutionContextTenantIdRequiredToResolveTools
source: Execution context TenantId is required to resolve tools.
vi_vn: Ngữ cảnh thực thi TenantId là bắt buộc để phân giải công cụ.

# Ex_ToolDoesNotSpecifySpName
source: Tool '{0}' does not specify an SP name.
vi_vn: Công cụ '{0}' không chỉ định tên SP.

# Ex_ConnectionStringNotFoundForTenant
source: Connection string not found for tenant '{0}'. Check configuration key 'ConnectionStrings:{0}'.
vi_vn: Không tìm thấy chuỗi kết nối cho người thuê '{0}'. Kiểm tra khóa cấu hình 'ConnectionStrings:{0}'.

# Ex_ConnectionStringNotFoundForTenantInMetadata
source: Connection string not found for tenant '{0}' in metadata store. Check configuration key 'ConnectionStrings:{0}'.
vi_vn: Không tìm thấy chuỗi kết nối cho người thuê '{0}' trong kho siêu dữ liệu. Kiểm tra khóa cấu hình 'ConnectionStrings:{0}'.

# Ex_AzureKeyVaultUriRequired
source: AzureKeyVaultUri is required for AzureKeyVault provider
vi_vn: AzureKeyVaultUri là bắt buộc cho nhà cung cấp AzureKeyVault

# Ex_SqlContractValidationFailed
source: SQL contract validation failed:{0}{1}
vi_vn: Xác thực hợp đồng SQL thất bại:{0}{1}

# Ex_ErrorCatalogCoverageCheckFailed
source: Error catalog coverage check failed.
vi_vn: Kiểm tra phạm vi danh mục lỗi thất bại.

# Ex_EmbeddingRequestFailed
source: Embedding request failed: {0}
vi_vn: Yêu cầu nhúng thất bại: {0}

# Ex_EmbeddingResponseContainedNoData
source: Embedding response contained no data.
vi_vn: Phản hồi nhúng không chứa dữ liệu.

# Ex_LlmRequestFailed
source: LLM request failed with status {0}: {1}
vi_vn: Yêu cầu LLM thất bại với trạng thái {0}: {1}

# Ex_LlmEndpointRequired
source: Llm:Endpoint is required for OpenAI-compatible provider.
vi_vn: Llm:Endpoint là bắt buộc cho nhà cung cấp tương thích OpenAI.

# Ex_LlmApiKeyRequired
source: Llm:ApiKey is required for OpenAI-compatible provider.
vi_vn: Llm:ApiKey là bắt buộc cho nhà cung cấp tương thích OpenAI.

# Ex_LlmModelRequired
source: Llm:Model is required for OpenAI-compatible provider.
vi_vn: Llm:Model là bắt buộc cho nhà cung cấp tương thích OpenAI.

# Ex_ExecutionContextConversationIdRequired
source: Execution context ConversationId is required.
vi_vn: Ngữ cảnh thực thi ConversationId là bắt buộc.

# Ex_ExecutionContextUserIdRequired
source: Execution context UserId is required.
vi_vn: Ngữ cảnh thực thi UserId là bắt buộc.

# Ex_TenantIdRequired
source: TenantId is required
vi_vn: TenantId là bắt buộc
